Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: - More than one space around an assignment (or other) operator to align it with another.
ko: - 할당(혹은 기타 다른) 연산자 주변에 한 개를 초과하는 공백 문자가 있는 경우.

source: - Object type comparisons should always use isinstance() instead of comparing types directly. ::
ko: - 객체 타입 비교 시, 타입을 직접 비교하는 대신 항상 isinstance()를 사용한다. ::

source: - PEP 257 describes good docstring conventions. Note that most importantly, the ``"""`` that ends a multiline docstring should be on a line by itself, and preferably preceded by a blank line, e.g.::
ko: - PEP 257은 좋은 docstring 작성 규칙에 대해 기술하고 있다. ``"""`` 영역이 끝나는 부분에서는 한 줄 전체에 ``"""`` 문자를 넣고, 바로 위의 한 줄을 빈 줄로 두어야 한다. 다음 예를 보자. ::

source: - Public attributes should have no leading underscores.
ko: - public 어트리뷰트는 언더스코어 문자로 시작해선 안된다.

source: - Relative imports for intra-package imports are highly discouraged. Always use the absolute package path for all imports. Even now that PEP 328 is fully implemented in Python 2.5, its style of explicit relative imports is actively discouraged; absolute imports are more portable and usually more readable.
ko: - 인접(relative) 경로를 사용하여 내부 패키지를 임포트하지 않도록 한다. 항상 절대 패키지 경로를 사용하여 임포트를 하도록 하자. 현재 파이썬 2.5에 PEP 328이 완전히 구현되어 있으나, 명시적 인접 임포트 (explicit relative import)는 여전히 권장되지 않는다; 절대 임포트 (역주: 절대 경로를 사용한 임포트)는 이식성이 높으며, 일반적으로 읽기 더 쉽다.

source: - The Python standard library will not use function annotations as that would result in a premature commitment to a particular annotation style. Instead, the annotations are left for users to discover and experiment with useful annotation styles.
ko: - 파이썬 표준 라이브러리는 특정 어노테이션 스타일에 얽매인 함수 어노테이션을 사용하지 않는다. 그 대신에, 사용자로 하여금 유용한 어노테이션 스타일을 직접 발견하고 실험해 볼 수 있도록 하고 있다. (역주: 여기에서의 함수 어노테이션은 다른 프로그래밍 언어의 함수 프로토타입과 비슷하게 함수에 대한 정의를 말한다. PEP 3107을 참고)

source: - Use ``''.startswith()`` and ``''.endswith()`` instead of string slicing to check for prefixes or suffixes.
ko: - 문자열의 접두사/접미사를 확인하기 위해 문자열을 직접 자르는 대신, ``''.startswith()``\ 와 ``''.endswith()``\ 를 사용한다.

source: - Use class-based exceptions.
ko: - 클래스 기반의 예외를 사용한다.

source: - Use string methods instead of the string module.
ko: - string 모듈 대신 문자열 관련 메서드를 사용한다.

source: - When catching exceptions, mention specific exceptions whenever possible instead of using a bare ``except:`` clause.
ko: - 예외를 처리할(catch) 때에는 범용적인 ``except:`` 절 대신, 처리할 특정한 예외를 명시하도록 한다.

source: - When implementing ordering operations with rich comparisons, it is best to implement all six operations (``__eq__``, ``__ne__``, ``__lt__``, ``__le__``, ``__gt__``, ``__ge__``) rather than relying on other code to only exercise a particular comparison.
ko: - 향상된 비교 연산자를 사용해 정렬 기능을 구현할 경우, 특정한 비교 연산만 구현하는 것 보다는 여섯 개의 연산(``__eq__``, ``__ne__``, ``__lt__``, ``__le__``, ``__gt__``, ``__ge__``)을 모두 구현하는 것이 최선의 방법이다.

source: - When importing a class from a class-containing module, it's usually okay to spell this::
ko: - 클래스를 포함하고 있는 모듈에서 클래스를 임포트할 때, 보통은 다음과 같이 기술한다. ::

source: - When raising an exception, use ``raise ValueError('message')`` instead of the older form ``raise ValueError, 'message'``.
ko: - 예외를 발생시키려면 `raise ValueError('message')`` 구문을 사용한다. 예전의 ``raise ValueError, 'message'`` 구문은 더 이상 사용하지 않는다.

source: - While sometimes it's okay to put an if/for/while with a small body on the same line, never do this for multi-clause statements. Also avoid folding such long lines!
ko: - 짧은 if/for/while 구문을 한 줄에 넣는 것은 괜찮지만, 여러 절을 가진 구문은 절대 한 줄에 기술하지 않는다. 또한 한 줄에 여러 구문을 기술하면서 줄바꿈을 하는 것도 피해야 한다.

source: - Write docstrings for all public modules, functions, classes, and methods. Docstrings are not necessary for non-public methods, but you should have a comment that describes what the method does. This comment should appear after the ``def`` line.
ko: - public으로 정의된 모든 모듈, 함수, 클래스, 메서드에 대해 docstring을 작성한다. public으로 정의되지 않은 메서드에는 docstring을 작성할 필요가 없다. 하지만 해당 메서드가 무슨 일을 하는지 설명하는 주석은 달아야 한다. 이러한 주석은 ``def``\ 가 있는 행 바로 다음 행에 작성한다.

source: - ``__double_leading_and_trailing_underscore__``: "magic" objects or attributes that live in user-controlled namespaces. E.g. ``__init__``, ``__import__`` or ``__file__``. Never invent such names; only use them as documented.
ko: - ``__double_leading_and_trailing_underscore__``: 사용자가 관리하는 네임스페이스 내에 있는 "마법(magic)" 객체. ``__init__``, ``__import__``, ``__file__`` 등이 그 예이다. 이러한 이름을 정의해서 사용하면 안 되며, 이미 문서화되어 있는 항목들만 사용해야 한다.

source: - ``__double_leading_underscore``: when naming a class attribute, invokes name mangling (inside class FooBar, ``__boo`` becomes ``_FooBar__boo``; see below).
ko: - ``__double_leading_underscore``: 클래스 어트리뷰트의 이름을 지으면 네임 맹글링(name mangling)이 발생한다 (FooBar 클래스 내부에 ``__boo``를 선언하면 이는 ``_FooBar__boo``\ 가 된다; 아래 내용을 참고하라).

source: - ``_single_leading_underscore``: weak "internal use" indicator. E.g. ``from M import *`` does not import objects whose name starts with an underscore.
ko: - ``_single_leading_underscore``: "내부에서 사용한다"는 것을 의미. 예를 들면, ``from M import *``\ 은 언더스코어로 시작하는 객체를 임포트하지 않는다.

source: - ``b`` (single lowercase letter) - ``B`` (single uppercase letter) - ``lowercase`` - ``lower_case_with_underscores`` - ``UPPERCASE`` - ``UPPER_CASE_WITH_UNDERSCORES`` - ``CapitalizedWords`` (or CapWords, or CamelCase -- so named because of the bumpy look of its letters [3]_). This is also sometimes known as StudlyCaps.
ko: - ``b`` (한 개의 소문자) - ``B`` (한 개의 대문자) - ``lowercase`` - ``lower_case_with_underscores`` - ``UPPERCASE`` - ``UPPER_CASE_WITH_UNDERSCORES`` - ``CapitalizedWords`` (CapWords 혹은 CamelCase -- CamelCase라는 이름은 글자가 툭 튀어나온 모양 때문에 붙은 이름이다 [3]_). 간혹 StudlyCaps이라고도 불린다.

source: - ``single_trailing_underscore_``: used by convention to avoid conflicts with Python keyword, e.g. ::
ko: - ``single_trailing_underscore_``: 파이썬 키워드와의 충돌을 방지하기 위해 쓰인다. 예::

source: -Barry Warsaw, PEP editor
ko: -Barry Warsaw, PEP 편집자

source: .. [1] PEP 1, PEP Purpose and Guidelines, Warsaw, Hylton (http://www.python.org/dev/peps/pep-0001)
ko: .. [1] PEP 1, PEP 목적 및 안내, Warsaw, Hylton (http://www.python.org/dev/peps/pep-0001)

source: .. [1] PEP 7, Style Guide for C Code, van Rossum
ko: .. [1] PEP 7, C 코드 스타일 가이드, van Rossum

source: .. [1] PEP 8, "Style Guide for Python Code", van Rossum, Warsaw (http://www.python.org/dev/peps/pep-0008)
ko: .. [1] PEP 8, "파이썬 코드 스타일 안내", van Rossum, Warsaw (http://www.python.org/dev/peps/pep-0008)

source: .. [1] This historical record is available by the normal hg commands for retrieving older revisions, and can also be browsed via HTTP here: http://hg.python.org/peps/
ko: .. [1] 이 이력 레코드는 이전 리비전을 조회하는 보통의 hg 명령으로 얻어낼 수 있으며, 다음 주소에서 HTTP를 통해 조회할 수 있다: http://hg.python.org/peps/

source: .. [2] Barry's GNU Mailman style guide http://barry.warsaw.us/software/STYLEGUIDE.txt
ko: .. [2] Barry의 GNU Mailman 스타일 가이드 http://barry.warsaw.us/software/STYLEGUIDE.txt

source: .. [2] PEP 2, Procedure for Adding New Modules, Faassen (http://www.python.org/dev/peps/pep-0002)
ko: .. [2] PEP 2, 새로운 모듈을 추가하는 절차, Faassen (http://www.python.org/dev/peps/pep-0002)

source: .. [2] PEP 9, Sample Plaintext PEP Template, Warsaw (http://www.python.org/dev/peps/pep-0009)
ko: .. [2] PEP 9, 일반 텍스트 PEP 템플릿 견본, Warsaw (http://www.python.org/dev/peps/pep-0009)

source: .. [3] PEP 9, Sample Plaintext PEP Template, Warsaw (http://www.python.org/dev/peps/pep-0009)
ko: .. [3] PEP 9, 일반 텍스트 PEP 템플릿 견본, Warsaw (http://www.python.org/dev/peps/pep-0009)

source: .. [4] PEP 12, Sample reStructuredText PEP Template, Goodger, Warsaw (http://www.python.org/dev/peps/pep-0012)
ko: .. [4] PEP 12, reStructuredText PEP 템플릿 견본, Goodger, Warsaw (http://www.python.org/dev/peps/pep-0012)

source: .. [5] The script referred to here is pep2pyramid.py, the successor to pep2html.py, both of which live in the same directory in the hg repo as the PEPs themselves. Try ``pep2html.py --help`` for details. The URL for viewing PEPs on the web is http://www.python.org/dev/peps/.
ko: .. [5] 여기서 참조하는 스크립트는 pep2html.py를 계승하는 pep2pyramid.py로, hg 저장소에서 PEP 자체가 있는 곳과 같은 디렉토리에 있다. 자세한 내용을 보려면 ``pep2html.py --help``\ 를 실행한다. 웹에서 PEP를 볼 수 있는 URL은 http://www.python.org/dev/peps/\ 이다.

source: .. _Open Publication License: http://www.opencontent.org/openpub/
ko: .. _공개 출판 라이선스: http://www.opencontent.org/openpub/

source: .. _PEP repository: http://hg.python.org/peps
ko: .. _PEP 저장소: http://hg.python.org/peps

source: .. _issue tracker: http://bugs.python.org/
ko: .. _이슈 트래커: http://bugs.python.org/

source: 1. A **Standards Track** PEP describes a new feature or implementation for Python. It may also describe an interoperability standard that will be supported outside the standard library for current Python versions before a subsequent PEP adds standard library support in a future version.
ko: 1. **표준 트랙** PEP는 파이썬의 새로운 기능이나 구현을 기술한다. 그것은 또한 차후의 PEP가 앞으로의 파이썬 버전에서 지원할 표준 라이브러리 지원을 추가하기에 앞서, 현재의 파이썬 버전을 위한 표준 라이브러리의 외부로부터 지원될 상호운용성 표준을 기술할 수도 있다.

source: 1. If the exception handler will be printing out or logging the traceback; at least the user will be aware that an error has occurred.
ko: 1. 예외 핸들러가 역추적(traceback) 결과를 출력하거나 로그를 남겨야 할 경우. 사용하가 최소한 에러가 일어났음을 인지할 수 있게 된다.

source: 1. Preamble -- RFC 822 style headers containing meta-data about the PEP, including the PEP number, a short descriptive title (limited to a maximum of 44 characters), the names, and optionally the contact info for each author, etc.
ko: 1. 서론 -- PEP 번호, 짧고 설명적인 제목(최대 44 글자로 제한), 이름, 각 저자에 대한 연락 정보 등의 PEP에 대한 메타 정보를 담은 RFC 822 스타일의 머리말.

source: 1. When applying the rule would make the code less readable, even for someone who is used to reading code that follows the rules.
ko: 1. 기존의 규칙을 따르는 코드를 읽는데 익숙한 사람조차 해당 규칙을 적용한 코드의 가독성이 나빠진다고 판단할 경우.

source: 1. standard library imports 2. related third party imports 3. local application/library specific imports
ko: 1. 표준 라이브러리 2. 관련이 있는 서드파티 라이브러리 3. 로컬 어플리케이션/자체 라이브러리

source: 2. Abstract -- a short (~200 word) description of the technical issue being addressed.
ko: 2. 초록 -- 기술적인 이슈에 대한 짧은(200 단어 이내) 설명을 제시.

source: 2. An **Informational** PEP describes a Python design issue, or provides general guidelines or information to the Python community, but does not propose a new feature. Informational PEPs do not necessarily represent a Python community consensus or recommendation, so users and implementers are free to ignore Informational PEPs or follow their advice.
ko: 2. **정보** PEP는 파이썬의 설계 상의 문제나 일반적인 지침 또는 파이썬 커뮤니티를 위한 정보를 기술하지만, 새로운 기능을 제안하지는 않는다. 정보 PEP가 반드시 파이썬 커뮤니티의 합의나 권고를 나타내는 것은 아니며, 따라서 사용자 및 구현자가 정보 PEP를 무시할 지 혹은 그 조언을 따를 지는 자유이다.

source: 2. If the code needs to do some cleanup work, but then lets the exception propagate upwards with ``raise``. ``try...finally`` can be a better way to handle this case.
ko: 2. 코드에서 일종의 정리 작업을 수행한 다음, ``raise`` 명령을 사용해 해당 예외를 상위 단계로 계속 올려보내려 할 경우. 이 경우에는 ``try...finally`` 구문을 사용하는 것이 더 나은 방법일 수 있다.

source: 2. To be consistent with surrounding code that also breaks it (maybe for historic reasons) -- although this is also an opportunity to clean up someone else's mess (in true XP style).
ko: 2. (아마 기존 관습 때문에) 일관성을 잃은 기존 코드를 갈아엎어서 코드의 일관성을 확립하고자 하는 경우. 이는 기존 코드의 지저분한 부분들을 (진정한 XP 스타일로) 정리할 수 있는 기회이기도 하다.

source: 3. A **Process** PEP describes a process surrounding Python, or proposes a change to (or an event in) a process. Process PEPs are like Standards Track PEPs but apply to areas other than the Python language itself. They may propose an implementation, but not to Python's codebase; they often require community consensus; unlike Informational PEPs, they are more than recommendations, and users are typically not free to ignore them. Examples include procedures, guidelines, changes to the decision-making process, and changes to the tools or environment used in Python development. Any meta-PEP is also considered a Process PEP.
ko: 3. **프로세스** PEP는 파이썬을 둘러싼 프로세스 또는 프로세스(또는 프로세스 내의 이벤트)의 변경을 기술한다. 프로세스 PEP들은 표준 트랙 PEP와 비슷하지만 파이썬 언어 자체가 아닌 영역에 적용된다. 구현에 대하여 제안할 수도 있지만, 파이썬의 코드 기반에 대한 것이 아니다. 그것들은 종종 커뮤니티의 합의를 필요로 하기 때문이다. 정보 PEP와 달리, 그것들은 권고 이상이며 사용자가 쉽게 무시할 수 없는 것들이다. 절차, 안내, 의사결정 프로세스의 변경 및 파이썬 개발에 사용되는 도구나 환경의 변화를 예로 들 수 있다. 메타 PEP 역시 프로세스 PEP로 간주한다.

source: 3. Copyright/public domain -- Each PEP must either be explicitly labeled as placed in the public domain (see this PEP as an example) or licensed under the `Open Publication License`_.
ko: 3. 저작권/공개 도메인 -- 각 PEP는 공개 도메인(이 PEP가 그 예이다) 또는 `공개 출판 라이선스`_\ 에 의거하여 라이선스됨을 명시하여야 한다.

source: 4. Specification -- The technical specification should describe the syntax and semantics of any new language feature. The specification should be detailed enough to allow competing, interoperable implementations for at least the current major Python platforms (CPython, Jython, IronPython, PyPy).
ko: 4. 명세 -- 기술적인 명세는 새로운 언어 기능에 대한 구문(syntax)과 의미 (semantics)를 기술한다. 명세는 최소한 현재의 주요한 파이썬 플랫폼(CPython, Jython, IronPython, PyPy)을 위한 경쟁적이고 상호운용 가능한 구현을 하기에 충분할 만큼 자세하여야 한다.

source: 5. Motivation -- The motivation is critical for PEPs that want to change the Python language. It should clearly explain why the existing language specification is inadequate to address the problem that the PEP solves. PEP submissions without sufficient motivation may be rejected outright.
ko: 5. 동기부여 -- 파이썬 언어를 바꾸고자 하는 PEP에 있어서 동기가 중요하다. PEP가 해결하고자하는 문제를 해결하기에 기존의 언어 명세가 불충분한 이유를 명확하게 설명하여야 한다. 충분한 동기 부여가 되지 않는 PEP 제출은 즉시 거부할 수 있다.

source: 6. Rationale -- The rationale fleshes out the specification by describing what motivated the design and why particular design decisions were made. It should describe alternate designs that were considered and related work, e.g. how the feature is supported in other languages.
ko: 6. 근거 -- 특정 디자인을 채택한 동기와 이유를 기술한다. 대체 가능한 다른 디자인에 대한 검토 결과와 함께, 다른 언어에서는 그 기능을 어떻게 지원하는지와 같은 관련 작업을 기술한다.

source: 7. Backwards Compatibility -- All PEPs that introduce backwards incompatibilities must include a section describing these incompatibilities and their severity. The PEP must explain how the author proposes to deal with these incompatibilities. PEP submissions without a sufficient backwards compatibility treatise may be rejected outright.
ko: 7. 하위 호환성 -- 이전 버전과 호환되지 않는 모든 PEP는 이러한 비호환성과 심각성을 기술하는 섹션을 포함하여야 한다. PEP는 이러한 비호환성을 어떻게 처리할 것인지에 대한 저자의 제안을 반드시 설명하여야 한다. 하위 호환성에 대한 적절한 논문을 갖추지 않은 PEP는 즉시 거부된다.

source: 8. Reference Implementation -- The reference implementation must be completed before any PEP is given status "Final", but it need not be completed before the PEP is accepted. While there is merit to the approach of reaching consensus on the specification and rationale before writing code, the principle of "rough consensus and running code" is still useful when it comes to resolving many discussions of API details.
ko: 8. 참조 구현 -- PEP가 "최종" 상태를 얻기 전에 참조 구현이 반드시 완성되어야 하지만, PEP가 수용되기 전에 반드시 완성되어야 하는 것은 아니다. 코드를 작성하기 전에 명세 및 근거에 대한 합의에 도달하는 데에 이점이 있기는 하지만, API의 세부사항에 대한 많은 논의를 해결하기 위한 "거친 합의와 실행되는 코드"의 원칙은 여전히 유효하다.

source: A Foolish Consistency is the Hobgoblin of Little Minds ======================================================
ko: 멍청하게 일관성을 고집하는 것은 소인배의 발상이다 =================================================

source: A PEP can also be "Rejected". Perhaps after all is said and done it was not a good idea. It is still important to have a record of this fact. The "Withdrawn" status is similar - it means that the PEP author themselves has decided that the PEP is actually a bad idea, or has accepted that a competing proposal is a better alternative.
ko: PEP는 "거부(Rejected)"될 수도 있다. 논의 끝에 좋지 못한 아이디어라고 판명되었기 때문일 수 있다. 이 사실에 대한 기록을 갖는 것이 중요하다. "철회(Withdrawn)" 상태도 이와 비슷하게, PEP 저자가 그 PEP에 대하여 좋지 못한 아이디어라고 생각하거나 경쟁 관계의 다른 제안이 더 나은 대안임을 받아들인 것을 의미한다.

source: A PEP can also be assigned status "Deferred". The PEP author or an editor can assign the PEP this status when no progress is being made on the PEP. Once a PEP is deferred, a PEP editor can re-assign it to draft status.
ko: PEP에는 "지연(Deferred)" 상태를 할당할 수도 있다. PEP에 대하여 아무 진전이 없을 때 PEP 저자 또는 편집자가 이 상태를 부여할 수 있다. PEP가 일단 지연되면, PEP 편집자는 그것을 초안 상태로 되돌릴 수 있다.

source: A PEP editor must subscribe to the <peps@python.org> list. All correspondence related to PEP administration should be sent (or forwarded) to <peps@python.org> (but please do not cross-post!).
ko: PEP 편집자는 <peps@python.org> 리스트를 구독해야 한다. PEP 관리에 관련된 모든 내용은 <peps@python.org>에 작성 또는 전달한다(엇갈리게 게재하지 말아달라!).

source: A bare ``except:`` clause will catch SystemExit and KeyboardInterrupt exceptions, making it harder to interrupt a program with Control-C, and can disguise other problems. If you want to catch all exceptions that signal program errors, use ``except Exception:`` (bare except is equivalent to ``except BaseException:``).
ko: 처리할 예외가 지정되지 않은 ``except:`` 절은 SystemExit, KeyboardInterrupt 예외를 처리하기 때문에 컨트롤-C를 눌러 프로그램을 인터럽트할 수 없게 만드는 등 여러 문제를 일으킬 소지가 있다. 만약 프로그램 에러의 징후를 알리는 모든 예외를 처리하고 싶다면 ``except Exception:``를 사용하도록 하자(처리할 예외가 지정되지 않은 except 절은 ``except BaseException:`` 절과 동일하다).

source: A good rule of thumb is to limit use of bare 'except' clauses to two cases:
ko: 예외가 지정되지 않은 'except' 절을 사용해야 하는 적절한 경우는 다음과 같다.

source: A style guide is about consistency. Consistency with this style guide is important. Consistency within a project is more important. Consistency within one module or function is most important.
ko: 스타일 가이드는 일관성을 다룬다. 이 스타일 가이드에서 다루는 일관성은 중요한 내용이다. 프로젝트에서의 일관성은 중요하지만, 특정한 모듈 혹은 함수 내에서의 일관성은 정말 중요하다.

source: Abstract
ko: 초록

source: Abstract --------
ko: 초록 ----

source: Abstract ========
ko: 초록 ====

source: Additional References
ko: 추가적인 참조

source: Advantages
ko: 장점

source: After a PEP number has been assigned, a draft PEP may be discussed further on python-ideas (getting a PEP number assigned early can be useful for ease of reference, especially when multiple draft PEPs are being considered at the same time). Eventually, all Standards Track PEPs must be sent to the `python-dev list <mailto:python-dev@python.org>`__ for review as described in the next section.
ko: PEP 번호가 할당되면, PEP 초안이 python-ideas에서 논의될 것이다(PEP 번호를 빨리 할당받는 것이 쉽게 찾는 데에 도움이 된다. 동시에 여러 개의 PEP 초안이 검토 중일 때 특히 그러하다). 결국, 모든 표준 트랙 PEP는 `python-dev 리스트 <mailto:python-dev@python.org>`__\ 로 보내어져서 다음 섹션에서 기술하는 바와 같이 검토된다.

source: Almost without exception, class names use the CapWords convention. Classes for internal use have a leading underscore in addition.
ko: 클래스 이름은 예외 없이 CapWords 규칙을 따른다. 또한 내부에서 사용하는 클래스는 앞에 언더스코어 문자 하나를 붙인다.

source: Also, beware of writing ``if x`` when you really mean ``if x is not None`` -- e.g. when testing whether a variable or argument that defaults to None was set to some other value. The other value might have a type (such as a container) that could be false in a boolean context!
ko: 또한, ``if x is not None``\ 의 의미로 ``if x``\ 를 사용하는데 주의해야 한다 -- 기본값이 None인 변수나 인수에 무언가 값이 지정되었는지를 검사할 경우를 예로 들 수 있다. 이 값이 다른 객체를 포함하는 타입 (컨테이너의 경우)일 수도 있으며, 그럴 경우 boolean으로 해석되어 false를 반환할 수 있다.

source: Alternative Approaches
ko: 다른 접근 방법

source: Alternatives
ko: 대안

source: Always decide whether a class's methods and instance variables (collectively: "attributes") should be public or non-public. If in doubt, choose non-public; it's easier to make it public later than to make a public attribute non-public.
ko: 항상 클래스의 메서드와 인스턴스 변수(둘을 합쳐 "어트리뷰트")가 public인지 public이 아닌지를 결정해야 한다. 결정이 어려울 경우 비 public으로 정의한다. 비 public 어트리뷰트를 public으로 변경하는 것이 그 반대의 경우보다 쉽다.

source: Always include a blank line between the signature line and the text of the description.
ko: 시그너쳐 행과 설명 텍스트 사이에는 항상 한 줄을 띄운다.

source: Always use ``cls`` for the first argument to class methods.
ko: 클래스 메서드의 첫 번째 인수에는 ``cls``\ 를 사용해야 한다.

source: Always use ``self`` for the first argument to instance methods.
ko: 인스턴스 메서드의 첫 번째 인수에는 ``self``\ 를 사용해야 한다.

source: An inline comment is a comment on the same line as a statement. Inline comments should be separated by at least two spaces from the statement. They should start with a # and a single space.
ko: 인라인 주석문은 코드와 동일한 행에 기술되는 주석문이다. 인라인 주석문은 코드에서 최소한 두 개 이상의 공백으로 분리되어 있어야 한다. 주석문은 # 문자와 한 개의 공백으로 시작해야 한다.

source: Another category of attributes are those that are part of the "subclass API" (often called "protected" in other languages). Some classes are designed to be inherited from, either to extend or modify aspects of the class's behavior. When designing such a class, take care to make explicit decisions about which attributes are public, which are part of the subclass API, and which are truly only to be used by your base class.
ko: 어트리뷰트의 또 다른 한 가지 유형으로 "서브클래스 API"의 일부를 들 수 있다 (다른 언어에서는 "protected"라고 표현하곤 한다). 클래스들 중 일부는 상속을 위한 부모 클래스로서 설계되며, 클래스의 행동을 구성하는 요소들을 확장하거나 변경할 수 있다. 이러한 클래스를 설계할 때 어떤 어트리뷰트가 public이 될지, 서브클래스 API의 일부가 될지, 기본 클래스에서만 쓰일지에 대해 명확한 결정을 내리는데 신경써야 한다.

source: As updates are necessary, the PEP author can check in new versions if they (or a collaborating developer) have hg push privileges, or else they can email new PEP versions to the PEP editors for publication.
ko: 업데이트가 성공적이면, PEP 저자는 hg push 권한을 가지고 있는 경우 직접(또는 동료 개발자를 통해) 새로운 버전을 체크인할 수도 있고, 새로운 PEP 버전을 PEP 편집자에게 이메일로 보내어 출판하도록 할 수도 있다.

source: At the same time, removing a module from the distribution is difficult, as it is not known in general whether anybody is still using it. This PEP defines a procedure for removing modules from the standard Python library. Usage of a module may be `deprecated', which means that it may be removed from a future Python release. The rationale for deprecating a module is also collected in this PEP. If the rationale turns out faulty, the module may become `undeprecated'.
ko: 한편, 배포본에서 모듈을 제거하는 것은 어려운데, 이는 누군가가 여전히 그것을 사용하고 있을지도 모르기 때문이다. 이 PEP는 표준 파이썬 라이브러리로부터 모듈을 제거하는 절차를 정의한다. 모듈의 사용은 `금지(deprecated)'될 수 있는데, 이는 미래의 파이썬 릴리스에서 그것이 제거될 수 있음을 의미한다. 모듈을 금지하는 근거도 역시 이 PEP에 수집하였다. 근거가 틀린 것으로 판명되면, 모듈은 `금지 해제(undeprecated)'될 수 있다.

source: Auxiliary Files ===============
ko: 보조적인 파일들 ===============

source: Avoid extraneous whitespace in the following situations:
ko: 다음과 같은 상황에서는 여분의 공백 문자를 사용하지 않는다.

source: BDFL Pronouncements
ko: BDFL 가라사대

source: Background
ko: 배경

source: Backward Compatibility
ko: 하위 호환성

source: Backwards compatibility
ko: 하위 호환성

source: Batteries Included Philosophy
ko: 배터리 포함의 철학

source: Beautiful is better than ugly. Explicit is better than implicit. Simple is better than complex. Complex is better than complicated. Flat is better than nested. Sparse is better than dense. Readability counts. Special cases aren't special enough to break the rules. Although practicality beats purity. Errors should never pass silently. Unless explicitly silenced. In the face of ambiguity, refuse the temptation to guess. There should be one-- and preferably only one --obvious way to do it. Although that way may not be obvious at first unless you're Dutch. Now is better than never. Although never is often better than *right* now. If the implementation is hard to explain, it's a bad idea. If the implementation is easy to explain, it may be a good idea. Namespaces are one honking great idea -- let's do more of those!
ko: 아름다움이 추함보다 좋다. 명시가 암시보다 좋다. 단순함이 복잡함보다 좋다. 복잡함이 꼬인 것보다 좋다. 수평이 계층보다 좋다. 여유로운 것이 밀집한 것보다 좋다. 가독성은 중요하다. 특별한 경우라는 것은 규칙을 어겨야 할 정도로 특별한 것이 아니다. 허나 실용성은 순수성에 우선한다. 오류 앞에서 절대 침묵하지 말지어다. 명시적으로 오류를 감추려는 의도가 아니라면. 모호함을 앞에 두고, 이를 유추하겠다는 유혹을 버려라. 어떤 일에든 명확한 - 바람직하며 유일한 - 방법이 존재한다. 비록 그대가 우둔하여 그 방법이 처음에는 명확해 보이지 않을지라도. 지금 하는게 아예 안하는 것보다 낫다. 아예 안하는 것이 지금 *당장*보다 나을 때도 있지만. 구현 결과를 설명하기 어렵다면, 그 아이디어는 나쁘다. 구현 결과를 설명하기 쉽다면, 그 아이디어는 좋은 아이디어일 수 있다. 네임스페이스는 대박 좋은 아이디어다 -- 마구 남용해라!

source: Because exceptions should be classes, the class naming convention applies here. However, you should use the suffix "Error" on your exception names (if the exception actually is an error).
ko: 예외는 클래스이므로 클래스 명명 규칙을 그대로 사용한다. 하지만, 예외 이름의 끝에 "Error"라는 접미사를 사용해야 한다 (예외가 실제로 에러일 경우에).

source: Because the PEPs are maintained as text files in a versioned repository, their revision history is the historical record of the feature proposal [1]_.
ko: PEP는 버전이 매겨진 저장소 내의 텍스트 파일로 관리되기 때문에, 버전의 이력이 곧 기능 제안에 대한 기록이 된다. [1]_

source: Blank Lines -----------
ko: 빈 줄 -----
